fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     reactingFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         10;

deltaT          0.001;

// Stability Controls
deltaT          1e-5;               // Start very small
adjustTimeStep  yes;                // Allow OpenFOAM to scale deltaT dynamically
maxCo           0.5;                // Fluid cannot cross more than half a cell p

writeControl    timeStep;
writeInterval   100;
purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    preciceAdapter
    {
        type            preciceAdapterFunctionObject;
        libs            ("libpreciceAdapterFunctionObject.so");
    }
}
