fluid-openfoam/constant/chemistryProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemistryProperties;
}

chemistryType
{
    chemistry solver;
    method    eulerImplicit;
}

chemistry       off; // Let Cantera handle the reactions
