fluid-openfoam/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.5 0 0);
boundaryField
{
    fuel_inlet        { type fixedValue; value uniform (0.5 0 0); }
    fuel_outlet       { type zeroGradient; }
    anode_interface   { type noSlip; }
    bottom_wall       { type noSlip; }
    
    air_inlet         { type fixedValue; value uniform (0.5 0 0); }
    air_outlet        { type zeroGradient; }
    cathode_interface { type noSlip; }
    top_wall          { type noSlip; }
    
    front             { type empty; }
    back              { type empty; }
}
