fluid-openfoam/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
2000
(
0.03
0.03
0.03
0.03
0.03
0.03
0.03
0.03
...
)
;

boundaryField
{
    fuel_inlet
    {
        type            fixedValue;
        value           uniform 0.03;
    }
    fuel_outlet
    {
        type            zeroGradient;
    }
    anode_interface
    {
        type            zeroGradient;
    }
    bottom_wall
    {
        type            zeroGradient;
    }
    air_inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    air_outlet
    {
        type            zeroGradient;
    }
    cathode_interface
    {
        type            zeroGradient;
    }
    top_wall
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
