fluid-openfoam/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
dimensions      [0 0 0 1 0 0 0];
internalField   uniform 873.15;
boundaryField
{
    fuel_inlet        { type fixedValue; value uniform 873.15; }
    fuel_outlet       { type zeroGradient; }
    anode_interface   { type zeroGradient; }
    bottom_wall       { type zeroGradient; }
    
    air_inlet         { type fixedValue; value uniform 873.15; }
    air_outlet        { type zeroGradient; }
    cathode_interface { type zeroGradient; }
    top_wall          { type zeroGradient; }
    
    front             { type empty; }
    back              { type empty; }
}
